#Задача 7

print("Вы ходили на выборы?")
answer1 = input()

print("Вы голосовали за КПРФ?")
answer2 = input()

if answer1 == "да" and answer2 == "да":
    print("Участие в выборах принято, голос отдан за партию КПРФ.")
elif answer1 == "да" and answer2 == "нет":
    print("Участие в выборах принято, голос отдан за другую партию или кандидата.")
elif answer1 == "нет" and answer2 == "да":
    print("На избирательный участок не ходили, но в опросе указали поддержку партии.")
else:
    print("Участие в выборах не принималось, поддержка партии не выражалась.")